export const rendererSettingsLocale = {
    title: "რენდერერის პარამეტრები",

    mode: {
        title: "ვიზუალიზაციის რეჟიმი",
        description: "არხების ვიზუალიზაციის რეჟიმის შეცვლა",
        waveforms: "ტალღის ფორმები",
        spectrumSplit: "სპექტრის გაყოფა",
        spectrum: "სპექტრი",
        filledWaveforms: "შევსებული ტალღის ფორმები"
    },

    noteFallingTime: {
        title: "ნოტის ვარდნის დრო (მილიწამები)",
        description: "რამდენად სწრაფად ეცემა ნოტები (ვიზუალურად)"
    },

    noteAfterTriggerTime: {
        title: "შენიშვნა ტრიგერის დროის შემდეგ (მილიწამები)",
        description:
            "რამდენ ხანს ცვივა ნოტები გააქტიურების შემდეგ. ნული ნიშნავს, რომ ისინი გააქტიურდება ბოლოში"
    },

    waveformThickness: {
        title: "ტალღის ფორმის ხაზის სისქე (პიქსელი)",
        description: "რამდენად სქელია ტალღის ფორმის ხაზები"
    },

    waveformSampleSize: {
        title: "ნიმუშის ზომა",
        description:
            "რამდენად დეტალურია ვიზუალიზაცია (შენიშვნა: მაღალმა მნიშვნელობებმა შეიძლება გავლენა მოახდინოს შესრულებაზე). ასევე გაითვალისწინეთ, რომ მაღალი მნიშვნელობები დაამატებს შეფერხებას აუდიოში ტალღური ფორმების აუდიოსთან სინქრონიზაციისთვის."
    },

    waveformAmplifier: {
        title: "გამაძლიერებელი",
        description: "რამდენად ნათელია ვიზუალიზაცია"
    },

    toggleExponentialGain: {
        title: "ექსპონენციალური მოგების ჩართვა",
        description:
            "სიმაღლის გამოსათვლელად ხაზოვანის ნაცვლად ექსპონენციალური მრუდის გამოყენებით, გაძლიერების სხვაობა უფრო თვალსაჩინო გახადეთ."
    },

    toggleDynamicGain: {
        title: "დინამიური გაძლიერების ჩართვა",
        description:
            "გაძლიერების ავტომატური რეგულირება ისე, რომ ყველაზე მაღალი წერტილი ყოველთვის ეკრანის ჭერს ეხებოდეს"
    },

    toggleLogarithmicFrequency: {
        title: "ლოგარითმული სიხშირის ჩართვა",
        description:
            "სიხშირის ზონები ლოგარითმული გზით გაანაწილეთ და არა წრფივი. რეკომენდებულია"
    },

    toggleNotesRendering: {
        title: "შენიშვნების ჩვენება",
        description:
            "MIDI ფაილის დაკვრისას დაცემული ნოტების რენდერინგის ჩართვა"
    },

    toggleDrawingActiveNotes: {
        title: "აქტიური შენიშვნების ჩვენება",
        description:
            "ჩართეთ ნოტების განათება და მოციმციმე დაჭერისას"
    },

    toggleDrawingVisualPitch: {
        title: "ვიზუალური ტონის ჩვენება",
        description:
            "ჩართეთ ნოტების მარცხნივ ან მარჯვნივ გადასრიალება, როდესაც გამოყენებულია ტონალური ბორბალი"
    },

    toggleDrawingPresetNames: {
        title: "წინასწარ დაყენებული სახელების ჩვენება",
        description: "ჩართეთ თითოეული ტალღის ფორმის მიმდინარე წინასწარ განსაზღვრული სახელების ჩვენება"
    },

    toggleRenderingDotDisplay: {
        title: "წერტილოვანი ჩვენების ჩვენება",
        description: "GS/XG წერტილოვანი ეკრანის შეტყობინებების დახატვის ჩართვა"
    },

    toggleStabilizeWaveforms: {
        title: "ტალღის ფორმების სტაბილიზაცია",
        description: "ოსცილოსკოპის გააქტიურების ჩართვა"
    }
};
