export const rendererSettingsLocale = {
    title: "ვიზუალიზატორის პარამეტრები",

    mode: {
        title: "ვიზუალიზაციის რეჟიმი",
        description: "არხების ვიზუალიზაციის რეჟიმის შეცვლა",
        waveforms: "ტალღური ფორმები",
        spectrumSplit: "გაყოფილი სპექტრი",
        spectrum: "სპექტრი",
        filledWaveforms: "შევსებული ტალღური ფორმები"
    },

    noteFallingTime: {
        title: "ნოტების ვარდნის დრო (მილიწამებში)",
        description: "რამდენად სწრაფად ეცემა ნოტები ვიზუალურად"
    },

    noteAfterTriggerTime: {
        title: "ნოტის ვარდნის დრო გააქტიურების შემდეგ (მილიწამებში)",
        description:
            "რამდენ ხანს ეცემა ნოტა გააქტიურების შემდეგ. მნიშვნელობა 0 ნიშნავს, რომ ნოტა ქვემოდან იწყებს გამოჩენას"
    },

    waveformThickness: {
        title: "ტალღური ფორმის ხაზის სისქე (px)",
        description: "ტალღური ფორმის ხაზების სისქე"
    },

    waveformSampleSize: {
        title: "ნიმუშის ზომა",
        description:
            "ვიზუალიზაციის დეტალიზაციის დონე. გაითვალისწინეთ: მაღალმა მნიშვნელობებმა შეიძლება შეამციროს წარმადობა. ასევე, ტალღური ფორმების აუდიოსთან სინქრონიზაციისთვის მაღალი მნიშვნელობები აუდიოს დაყოვნებას იწვევს."
    },

    waveformAmplifier: {
        title: "გაძლიერება",
        description: "რამდენად მკაფიო და ინტენსიურია ვიზუალიზაცია"
    },

    toggleExponentialGain: {
        title: "ექსპონენციალური გაძლიერების ჩართვა",
        description:
            "გაძლიერების განსხვავებების უკეთ წარმოსაჩენად სიმაღლის გამოთვლისას ხაზოვანის ნაცვლად ექსპონენციალური მრუდის გამოყენება"
    },

    toggleDynamicGain: {
        title: "დინამიკური გაძლიერების ჩართვა",
        description:
            "გაძლიერების ავტომატური რეგულირება ისე, რომ უმაღლესი წერტილი ყოველთვის აღწევდეს ეკრანის ზედა ზღვარს"
    },

    toggleLogarithmicFrequency: {
        title: "სიხშირის ლოგარითმული სკალის ჩართვა",
        description:
            "სიხშირის დიაპაზონების ხაზოვანის ნაცვლად ლოგარითმული პრინციპით განაწილება. რეკომენდებულია."
    },

    toggleNotesRendering: {
        title: "ნოტების ჩვენება",
        description:
            "MIDI ფაილის დაკვრისას მოძრავი ნოტების ვიზუალიზაციის ჩართვა"
    },

    toggleDrawingActiveNotes: {
        title: "აქტიური ნოტების ჩვენება",
        description:
            "ნოტების განათებისა და ნათების ეფექტის ჩართვა მათ დაჭერისას"
    },

    toggleDrawingVisualPitch: {
        title: "ბგერის სიმაღლის ვიზუალური ცვლილების ჩვენება",
        description:
            "Pitch Wheel-ის გამოყენებისას ნოტების მარცხნივ ან მარჯვნივ გადაადგილების ჩართვა"
    },

    toggleDrawingPresetNames: {
        title: "პრესეტების სახელების ჩვენება",
        description:
            "თითოეული ტალღური ფორმისთვის მიმდინარე პრესეტის სახელის ჩვენება"
    },

    toggleRenderingDotDisplay: {
        title: "წერტილოვანი ეკრანის ჩვენება",
        description:
            "GS/XG წერტილოვანი ეკრანის შეტყობინებების ვიზუალიზაციის ჩართვა"
    },

    toggleStabilizeWaveforms: {
        title: "ტალღური ფორმების სტაბილიზაცია",
        description: "ოსცილოსკოპის სინქრონიზაციის ჩართვა"
    }
};
