export const exportFile = {
    button: {
        title: "Экспорт файла",
        description: "Экспорт композиции в различные форматы"
    },

    formats: {
        title: "Выберите формат",
        formats: {
            wav: {
                button: {
                    title: "Аудио WAV (.wav)",
                    description:
                        "Экспортировать композицию с применёнными изменениями в аудиофайл .wav"
                },
                options: {
                    title: "Параметры экспорта WAV",
                    description:
                        "Экспортировать текущий MIDI-файл в WAV, применив все изменения, внесённые через контроллер синтезатора.",
                    confirm: "Экспортировать",
                    normalizeVolume: {
                        title: "Нормализовать громкость",
                        description:
                            "Поддерживать одинаковый уровень громкости независимо от громкости MIDI. Рекомендуется."
                    },
                    additionalTime: {
                        title: "Дополнительное время (с)",
                        description:
                            "Дополнительное время в конце композиции, чтобы звук успел затихнуть (в секундах)."
                    },
                    sampleRate: {
                        title: "Частота дискретизации",
                        description:
                            "Частота дискретизации выходного файла в Гц. Не меняйте это значение, если не знаете, что делаете."
                    },

                    separateChannels: {
                        title: "Разделить каналы",
                        description:
                            "Сохранить каждый канал в отдельный файл. Полезно, например, для просмотра осциллограмм. Обратите внимание: при этом реверберация и хор отключаются.",
                        saving: {
                            title: "Файлы каналов",
                            save: "Сохранить канал {0}",
                            saveAll: "Сохранить все",
                            saveFullMix: "Сохранить полный микс"
                        }
                    },
                    loopCount: {
                        title: "Количество повторов",
                        description: "Количество повторов композиции"
                    }
                },
                exportMessage: {
                    message: "Экспорт аудио WAV...",
                    addingEffects: "Добавление эффектов...",
                    estimated: "Осталось:",
                    convertWav: "Преобразование в WAV..."
                }
            },

            midi: {
                button: {
                    title: "MIDI (.mid)",
                    description:
                        "Экспортировать MIDI-файл с применёнными изменениями контроллера и инструментов"
                }
            },

            video: {
                button: {
                    title: "Видео (.webm, .mp4)",
                    description:
                        "Экспортировать композицию в видео с использованием визуализатора в реальном времени и отображением клавиатуры"
                },
                options: {
                    title: "Параметры экспорта видео",
                    description:
                        "Экспортировать текущий MIDI-файл в видео, используя текущие настройки визуализатора, нот, клавиатуры и макета.",
                    confirm: "Экспортировать",
                    format: {
                        title: "Формат",
                        description:
                            "Формат видеофайла. MP4 совместим с большим количеством программ, но менее эффективен."
                    },
                    resolution: {
                        title: "Разрешение",
                        description:
                            "Разрешение видео. Автоматический режим использует текущий размер холста."
                    },
                    frameRate: {
                        title: "Частота кадров",
                        description:
                            "Количество кадров в секунду: от 15 до 240. Если вы не знаете, что это значит, используйте 60."
                    }
                },
                exportMessage: {
                    message: "Экспорт видео...",
                    renderingAudio: "Обработка аудио...",
                    renderingVideo: "Создание видео...",
                    invalidResolution: "Недопустимое разрешение.",
                    webCodecsMissing:
                        "Этот браузер не поддерживает экспорт видео. Используйте последнюю версию Chrome или Firefox.",
                    failed: "Не удалось экспортировать видео! Подробности смотрите в консоли."
                }
            },

            soundfont: {
                button: {
                    title: "SoundFont (.sf2, .sf3)",
                    description: "Экспортировать файл SoundFont2"
                },

                options: {
                    title: "Параметры экспорта SF",
                    confirm: "Экспортировать",
                    trim: {
                        title: "Обрезка",
                        description:
                            "Экспортировать SoundFont, оставив только инструменты и образцы, используемые в MIDI-файле"
                    },
                    compress: {
                        title: "Сжать",
                        description:
                            "Сжать несжатые образцы с потерями с помощью кодека Ogg Vorbis. Это значительно уменьшит размер файла." +
                            "Если SoundFont уже сжат, он не будет распакован, даже если этот параметр отключён."
                    },
                    quality: {
                        title: "Качество сжатия",
                        description:
                            "Качество сжатия. Чем выше значение, тем лучше качество."
                    }
                },

                exportMessage: {
                    message: "Экспорт SoundFont..."
                }
            },

            dls: {
                button: {
                    title: "DLS (.dls)",
                    description: "Экспортировать SoundFont в формате DLS"
                },
                warning: {
                    title: "Предупреждение об экспорте DLS",
                    message:
                        "Экспорт в DLS ограничен и может привести к созданию повреждённых файлов при использовании больших и сложных SoundFont.",
                    details: "Подробнее",
                    confirm: "Всё равно экспортировать"
                },

                exportMessage: {
                    message: "Экспорт DLS..."
                }
            },

            rmidi: {
                button: {
                    title: "MIDI со встроенным SoundFont (.rmi)",
                    description:
                        "Экспортировать изменённый MIDI со встроенным обрезанным SoundFont в один файл. " +
                        "Обратите внимание: этот формат поддерживается далеко не всеми программами."
                },

                progress: {
                    title: "Экспорт MIDI со встроенными данными...",
                    loading: "Загрузка SoundFont и MIDI...",
                    modifyingMIDI: "Изменение MIDI...",
                    modifyingSoundfont:
                        "Обрезка SoundFont... (это может занять некоторое время!)",
                    saving: "Сохранение RMIDI...",
                    done: "Готово!"
                },

                options: {
                    title: "Параметры экспорта RMIDI",
                    description:
                        "Встроить текущие SoundFont и MIDI в файл RMIDI и применить все изменения, внесённые через контроллер синтезатора.",
                    confirm: "Экспортировать",
                    compress: {
                        title: "Сжать",
                        description:
                            "Сжать SoundFont с потерями с помощью кодека Ogg Vorbis. Это значительно уменьшит размер файла. Рекомендуется."
                    },
                    quality: {
                        title: "Качество сжатия",
                        description:
                            "Качество сжатия. Чем выше значение, тем лучше качество."
                    },
                    bankOffset: {
                        title: "Смещение банка",
                        description:
                            "Смещение банка в файле. Рекомендуется значение 0. Не меняйте его, если не знаете, что делаете."
                    },
                    adjust: {
                        title: "Адаптировать MIDI",
                        description:
                            "Адаптировать MIDI-файл под SoundFont. Оставьте этот параметр включённым, если не знаете, что делаете."
                    }
                }
            }
        },
        metadata: {
            songTitle: {
                title: "Название",
                description: "Название композиции"
            },
            album: {
                title: "Альбом",
                description: "Альбом, к которому относится композиция"
            },
            artist: {
                title: "Исполнитель",
                description: "Исполнитель композиции"
            },
            albumCover: {
                title: "Обложка альбома",
                description: "Обложка альбома композиции"
            },
            creationDate: {
                title: "Дата создания",
                description: "Дата создания композиции"
            },
            genre: {
                title: "Жанр",
                description: "Жанр композиции"
            },
            comment: {
                title: "Комментарий",
                description: "Комментарий к композиции"
            },
            duration: {
                title: "Длительность",
                description: "Длительность композиции"
            },
            subject: {
                title: "Тема",
                description: "Тема композиции"
            },
            software: {
                title: "Программа",
                description: "Программа, использованная для создания композиции"
            }
        }
    }
};
