export const exportFile = {
    button: {
        title: "ფაილის ექსპორტი",
        description: "კომპოზიციის სხვადასხვა ფორმატში ექსპორტი"
    },

    formats: {
        title: "აირჩიეთ ფორმატი",
        formats: {
            wav: {
                button: {
                    title: "WAV აუდიო (.wav)",
                    description:
                        "შეცვლილი კომპოზიციის .wav აუდიოფაილად ექსპორტი"
                },
                options: {
                    title: "WAV ექსპორტის პარამეტრები",
                    description:
                        "მიმდინარე MIDI ფაილის WAV ფორმატში ექსპორტი სინთეზატორის კონტროლერის მეშვეობით შეტანილი ყველა ცვლილების გამოყენებით.",
                    confirm: "ექსპორტი",
                    normalizeVolume: {
                        title: "ხმის დონის ნორმალიზაცია",
                        description:
                            "შეინარჩუნეთ ხმის ერთნაირი დონე MIDI-ის თავდაპირველი ხმამაღლობის მიუხედავად. რეკომენდებულია."
                    },
                    additionalTime: {
                        title: "დამატებითი დრო (წმ)",
                        description:
                            "კომპოზიციის ბოლოს დამატებული დრო, რათა ხმამ თანდათანობით ჩაკლება მოასწროს (წამებში)."
                    },
                    sampleRate: {
                        title: "დისკრეტიზაციის სიხშირე",
                        description:
                            "გამომავალი ფაილის დისკრეტიზაციის სიხშირე ჰერცებში. არ შეცვალოთ, თუ ზუსტად არ იცით, რას აკეთებთ."
                    },

                    separateChannels: {
                        title: "არხების ცალ-ცალკე შენახვა",
                        description:
                            "თითოეული არხი ცალკე ფაილად შეინახეთ. გამოსადეგია, მაგალითად, ოსცილოგრამების სანახავი პროგრამებისთვის. გაითვალისწინეთ, რომ ეს გამორთავს რევერბერაციასა და ქორუსის ეფექტს.",
                        saving: {
                            title: "არხების ფაილები",
                            save: "არხის {0} შენახვა",
                            saveAll: "ყველას შენახვა",
                            saveFullMix: "სრული მიქსის შენახვა"
                        }
                    },
                    loopCount: {
                        title: "გამეორებების რაოდენობა",
                        description: "კომპოზიციის გამეორებების რაოდენობა"
                    }
                },
                exportMessage: {
                    message: "WAV აუდიოს ექსპორტი...",
                    addingEffects: "ეფექტების დამატება...",
                    estimated: "დარჩენილია:",
                    convertWav: "WAV ფორმატში გარდაქმნა..."
                }
            },

            midi: {
                button: {
                    title: "MIDI (.mid)",
                    description:
                        "MIDI ფაილის ექსპორტი კონტროლერისა და ინსტრუმენტების ცვლილებების გათვალისწინებით"
                }
            },

            video: {
                button: {
                    title: "ვიდეო (.webm, .mp4)",
                    description:
                        "კომპოზიციის ვიდეოდ ექსპორტი რეალურ დროში მომუშავე ვიზუალიზატორითა და კლავიატურის ვიზუალიზაციით"
                },
                options: {
                    title: "ვიდეოს ექსპორტის პარამეტრები",
                    description:
                        "მიმდინარე MIDI ფაილის ვიდეოდ ექსპორტი ვიზუალიზატორის, ნოტების, კლავიატურისა და განლაგების მიმდინარე პარამეტრების გამოყენებით.",
                    confirm: "ექსპორტი",
                    format: {
                        title: "ფორმატი",
                        description:
                            "ვიდეოფაილის კონტეინერის ფორმატი. MP4 უფრო ფართოდ თავსებადია, თუმცა ნაკლებად ეფექტიანია."
                    },
                    resolution: {
                        title: "გარჩევადობა",
                        description:
                            "ვიდეოს გარჩევადობა. ავტომატური რეჟიმი მიმდინარე ტილოს ზომას იყენებს."
                    },
                    frameRate: {
                        title: "კადრების სიხშირე",
                        description:
                            "კადრების რაოდენობა წამში: 15-დან 240-მდე. თუ არ იცით, რას ნიშნავს ეს, გამოიყენეთ 60."
                    }
                },
                exportMessage: {
                    message: "ვიდეოს ექსპორტი...",
                    renderingAudio: "აუდიოს დამუშავება...",
                    renderingVideo: "ვიდეოს შექმნა...",
                    invalidResolution: "არასწორი გარჩევადობა.",
                    webCodecsMissing:
                        "ეს ბრაუზერი ვიდეოს ექსპორტს ვერ ახერხებს. გამოიყენეთ Chrome-ის ან Firefox-ის უახლესი ვერსია.",
                    failed: "ვიდეოს ექსპორტი ვერ მოხერხდა! დეტალებისთვის იხილეთ კონსოლი."
                }
            },

            soundfont: {
                button: {
                    title: "SoundFont (.sf2, .sf3)",
                    description: "SoundFont2 ფაილის ექსპორტი"
                },

                options: {
                    title: "SF ექსპორტის პარამეტრები",
                    confirm: "ექსპორტი",
                    trim: {
                        title: "შემცირება",
                        description:
                            "SoundFont-ის ექსპორტი მხოლოდ იმ ინსტრუმენტებითა და აუდიოს ნიმუშებით, რომლებსაც MIDI ფაილი იყენებს"
                    },
                    compress: {
                        title: "შეკუმშვა",
                        description:
                            "შეკუმშეთ შეუკუმშავი ნიმუშები Ogg Vorbis-ის დანაკარგიანი შეკუმშვით. ეს მნიშვნელოვნად ამცირებს ფაილის ზომას." +
                            "თუ SoundFont უკვე შეკუმშულია, ეს პარამეტრი გამორთულიც რომ იყოს, ფაილი არ გაიშლება."
                    },
                    quality: {
                        title: "შეკუმშვის ხარისხი",
                        description:
                            "შეკუმშვის ხარისხი. რაც უფრო მაღალია მნიშვნელობა, მით უკეთესია ხარისხი."
                    }
                },

                exportMessage: {
                    message: "SoundFont-ის ექსპორტი..."
                }
            },

            dls: {
                button: {
                    title: "DLS (.dls)",
                    description: "SoundFont-ის DLS ფორმატში ექსპორტი"
                },
                warning: {
                    title: "DLS ექსპორტის გაფრთხილება",
                    message:
                        "DLS ფორმატში ექსპორტს შეზღუდვები აქვს და დიდი, რთული SoundFont-ების შემთხვევაში შესაძლოა დაზიანებული ფაილები შეიქმნას.",
                    details: "დამატებითი ინფორმაცია",
                    confirm: "მაინც ექსპორტი"
                },

                exportMessage: {
                    message: "DLS-ის ექსპორტი..."
                }
            },

            rmidi: {
                button: {
                    title: "ჩაშენებული MIDI (.rmi)",
                    description:
                        "შეცვლილი MIDI-ისა და მასში ჩაშენებული შემცირებული SoundFont-ის ერთ ფაილად ექსპორტი. " +
                        "გაითვალისწინეთ, რომ ამ ფორმატს ფართო მხარდაჭერა არ აქვს."
                },

                progress: {
                    title: "ჩაშენებული MIDI-ის ექსპორტი...",
                    loading: "SoundFont-ისა და MIDI-ის ჩატვირთვა...",
                    modifyingMIDI: "MIDI-ის შეცვლა...",
                    modifyingSoundfont:
                        "SoundFont-ის შემცირება... (ამას შეიძლება გარკვეული დრო დასჭირდეს!)",
                    saving: "RMIDI-ის შენახვა...",
                    done: "დასრულებულია!"
                },

                options: {
                    title: "RMIDI ექსპორტის პარამეტრები",
                    description:
                        "მიმდინარე SoundFont-ისა და MIDI-ის RMIDI ფაილში ჩაშენება და სინთეზატორის კონტროლერის მეშვეობით შეტანილი ყველა ცვლილების გამოყენება.",
                    confirm: "ექსპორტი",
                    compress: {
                        title: "შეკუმშვა",
                        description:
                            "SoundFont-ის შეკუმშვა Ogg Vorbis-ის დანაკარგიანი შეკუმშვით. ეს მნიშვნელოვნად ამცირებს ფაილის ზომას. რეკომენდებულია."
                    },
                    quality: {
                        title: "შეკუმშვის ხარისხი",
                        description:
                            "შეკუმშვის ხარისხი. რაც უფრო მაღალია მნიშვნელობა, მით უკეთესია ხარისხი."
                    },
                    bankOffset: {
                        title: "ბანკის წანაცვლება",
                        description:
                            "ფაილის ბანკის წანაცვლება. რეკომენდებულია მნიშვნელობა 0. შეცვალეთ მხოლოდ იმ შემთხვევაში, თუ ზუსტად იცით, რას აკეთებთ."
                    },
                    adjust: {
                        title: "MIDI-ის მორგება",
                        description:
                            "MIDI ფაილის SoundFont-ზე მორგება. დატოვეთ ჩართული, თუ ზუსტად არ იცით, რას აკეთებთ."
                    }
                }
            }
        },
        metadata: {
            songTitle: {
                title: "სათაური",
                description: "კომპოზიციის სათაური"
            },
            album: {
                title: "ალბომი",
                description: "ალბომი, რომელშიც კომპოზიცია შედის"
            },
            artist: {
                title: "შემსრულებელი",
                description: "კომპოზიციის შემსრულებელი"
            },
            albumCover: {
                title: "ალბომის ყდა",
                description: "კომპოზიციის ალბომის ყდა"
            },
            creationDate: {
                title: "შექმნის თარიღი",
                description: "კომპოზიციის შექმნის თარიღი"
            },
            genre: {
                title: "ჟანრი",
                description: "კომპოზიციის ჟანრი"
            },
            comment: {
                title: "კომენტარი",
                description: "კომენტარი კომპოზიციის შესახებ"
            },
            duration: {
                title: "ხანგრძლივობა",
                description: "კომპოზიციის ხანგრძლივობა"
            },
            subject: {
                title: "თემა",
                description: "კომპოზიციის თემა"
            },
            software: {
                title: "პროგრამა",
                description:
                    "პროგრამა, რომელიც კომპოზიციის შესაქმნელად გამოიყენეს"
            }
        }
    }
};
