export const channelControllerLocale = {
    voiceMeter: {
        title: "ხმები: ",
        description:
            "ხმები: არხ {0}-ზე ამჟამად დაკრული ხმების რაოდენობა"
    },

    pitchBendMeter: {
        title: "სიმაღლე: ",
        description:
            "სიმაღლის ბორბალი: მიმდინარე სიმაღლის მოხრა გამოყენებულია არხ {0}-ზე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    panMeter: {
        title: "პანორამირება: ",
        description:
            "პანორამირება: მიმდინარე სტერეო პანორამირება გამოყენებულია {0} არხზე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    expressionMeter: {
        title: "გამოხატულება: ",
        description:
            "გამოსახულება: არხის {0} მიმდინარე გამოსახულება (ხმამაღლა) (დასაბლოკად დააწკაპუნეთ მაუსის მარჯვენა ღილაკით)"
    },

    volumeMeter: {
        title: "ხმა: ",
        description:
            "ხმა: არხის {0} მიმდინარე ხმა (დასაბლოკად დააწკაპუნეთ მაუსის მარჯვენა ღილაკით)"
    },

    modulationWheelMeter: {
        title: "მოდულაციის ბორბალი: ",
        description:
            "მოდულაციის ბორბალი: არხის {0} მიმდინარე მოდულაციის (ჩვეულებრივ ვიბრატო) სიღრმე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    chorusMeter: {
        title: "გუნდი: ",
        description:
            "გუნდური დონე: არხ {0}-ზე გამოყენებული გუნდური ეფექტის მიმდინარე დონე (დასაკეტად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    reverbMeter: {
        title: "რევერბერაცია: ",
        description:
            "რევერბერაციის დონე: არხ {0}-ზე გამოყენებული რევერბერაციის ეფექტის მიმდინარე დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    delayMeter: {
        title: "შეფერხება: ",
        description:
            "დაყოვნების დონე: არხ {0}-ზე გამოყენებული დაყოვნების ეფექტის მიმდინარე დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    filterMeter: {
        title: "ფილტრი: ",
        description:
            "ფილტრის გათიშვა: დაბალი სიხშირის ფილტრის გათიშვის მიმდინარე დონე, რომელიც გამოყენებულია {0} არხზე (დასაკეტად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    resonanceMeter: {
        title: "რეზონანსი: ",
        description:
            "ფილტრის რეზონანსი: არხ {0}-ზე გამოყენებული დაბალი სიხშირეების ფილტრის მიმდინარე რეზონანსის (Q) დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    transposeMeter: {
        title: "კლავიშის ცვლა: ",
        description:
            "კლავიშის ცვლა: არხის {0} მიმდინარე ტრანსპოზიცია (კლავიშის ცვლა)."
    },

    fineTuneMeter: {
        title: "ზუსტი რეგულირება: ",
        description:
            "ზუსტი რეგულირება: არხის {0} მიმდინარე ზუსტი რეგულირება (ცენტებში)."
    },

    gainMeter: {
        title: "გაძლიერება: ",
        description:
            "გაძლიერება: არხის {0} მიმდინარე გაძლიერება. ეს არ ინახება MIDI ფაილში!"
    },

    attackMeter: {
        title: "შეტევის დრო: ",
        description:
            "შეტევის დრო: არხის {0} მიმდინარე შეტევის დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    releaseMeter: {
        title: "გამოშვების დრო: ",
        description:
            "გამოშვების დრო: არხის {0} მიმდინარე გამოშვების დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    decayMeter: {
        title: "დაშლის დრო: ",
        description:
            "დაშლის დრო: არხის {0} მიმდინარე დაშლის დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    portamentoTimeMeter: {
        title: "გადატანის დრო: ",
        description:
            "გადატანის დრო: არხის {0} მიმდინარე გადატანის დრო (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით). გადატანის გამორთვისთვის დააყენეთ 0-ზე."
    },

    portamentoControlMeter: {
        title: "პორტამენტოს კონტროლი: ",
        description:
            "პორტამენტოს კონტროლი: საწყისი გასაღების ნომერი, საიდანაც უნდა გადაადგილდეთ {0} არხზე (ალბათ არ გსურთ ამის დაბლოკვა)"
    },

    velocitySenseDepthMeter: {
        title: "შეგრძნების სიღრმე: ",
        description:
            "სიჩქარის სენსორის სიღრმე: რამდენად მგრძნობიარეა სიჩქარე {0} არხზე (დააწკაპუნეთ მარჯვენა ღილაკით დაბლოკვისთვის)"
    },

    velocitySenseOffsetMeter: {
        title: "სენსორული ოფსეტი: ",
        description:
            "სიჩქარის სენსორის გადახრა: სიჩქარის გადახრა {0} არხისთვის (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    groupSelector: {
        description: "აირჩიეთ MIDI კონტროლერების ჯგუფი მანიპულირებისთვის",
        effects: "ეფექტები",
        volumeEnvelope: "ტომის კონვერტი",
        filter: "ფილტრი",
        portamento: "პორტამენტო (სრიალა)",
        velocitySense: "სიჩქარის შეგრძნება",
        systemParameters: "სისტემის პარამეტრები"
    },

    presetSelector: {
        description: "შეცვალეთ პატჩის (ინსტრუმენტის) არხი, რომელსაც {0} იყენებს",
        selectionPrompt: "ინსტრუმენტის შეცვლა არხისთვის {0}",
        searchPrompt: "ძიება..."
    },

    presetReset: {
        description: "პროგრამის ცვლილებების დასაშვებად განბლოკეთ არხი {0}"
    },

    soloButton: {
        description: "სოლო არხ {0}-ზე"
    },

    muteButton: {
        description: "არხის დადუმება/დადუმების მოხსნა {0}"
    },

    drumToggleButton: {
        description: "დასარტყამი ინსტრუმენტების გადართვა {0} არხზე"
    },

    polyMonoButton: {
        description: `პოლი/მონო რეჟიმის გადართვა {0} არხზე`
    },

    insertionEffectButton: {
        description: `არხ {0}-ზე ჩასმის ეფექტის გადართვა`
    }
};
