export const channelControllerLocale = {
    voiceMeter: {
        title: "ხმები: ",
        description: "ხმები: ამჟამად არხზე {0} დაკრული ხმების რაოდენობა"
    },

    pitchBendMeter: {
        title: "ტონის ცვლილება: ",
        description:
            "ტონის ბორბალი: არხზე {0} გამოყენებული ტონის სიმაღლის მიმდინარე ცვლილება (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    panMeter: {
        title: "პანორამა: ",
        description:
            "პანორამა: არხის {0} მიმდინარე სტერეოპოზიცია (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    expressionMeter: {
        title: "გამომსახველობა: ",
        description:
            "გამომსახველობა: არხის {0} მიმდინარე გამომსახველობა (ხმის სიმძლავრე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    volumeMeter: {
        title: "ხმის დონე: ",
        description:
            "ხმის დონე: არხის {0} მიმდინარე ხმამაღლობა (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    modulationWheelMeter: {
        title: "მოდულაცია: ",
        description:
            "მოდულაციის ბორბალი: არხის {0} მოდულაციის მიმდინარე სიღრმე (ჩვეულებრივ, ვიბრატო) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    chorusMeter: {
        title: "ქორუსი: ",
        description:
            "ქორუსის დონე: არხზე {0} გამოყენებული ქორუსის ეფექტის მიმდინარე დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    reverbMeter: {
        title: "რევერბერაცია: ",
        description:
            "რევერბერაციის დონე: არხზე {0} გამოყენებული რევერბერაციის ეფექტის მიმდინარე დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    variationMeter: {
        title: "ვარიაცია: ",
        description:
            "ვარიაციის დონე: არხზე {0} გამოყენებული ვარიაციის ეფექტის მიმდინარე დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    filterMeter: {
        title: "ფილტრი: ",
        description:
            "ფილტრის ათვლის სიხშირე: არხზე {0} გამოყენებული დაბალი სიხშირეების ფილტრის მიმდინარე ათვლის სიხშირე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    resonanceMeter: {
        title: "რეზონანსი: ",
        description:
            "ფილტრის რეზონანსი: არხზე {0} გამოყენებული დაბალი სიხშირეების ფილტრის მიმდინარე რეზონანსის (Q) დონე (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    transposeMeter: {
        title: "ტონალობის ცვლილება: ",
        description:
            "ტონალობის ცვლილება: არხის {0} მიმდინარე ტრანსპოზიცია (ტონალობის ცვლილება)."
    },

    fineTuneMeter: {
        title: "ზუსტი ტონირება: ",
        description:
            "ზუსტი ტონირება: არხის {0} მიმდინარე ზუსტი ტონირება ცენტებში."
    },

    gainMeter: {
        title: "გაძლიერება: ",
        description:
            "გაძლიერება: არხის {0} მიმდინარე გაძლიერება. ეს მნიშვნელობა MIDI ფაილში არ შეინახება!"
    },

    attackMeter: {
        title: "შეტევის დრო: ",
        description:
            "შეტევის დრო: არხის {0} ხმის ამოსვლის მიმდინარე დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    releaseMeter: {
        title: "ჩაქრობის დრო: ",
        description:
            "ჩაქრობის დრო: არხის {0} ხმის ჩაქრობის მიმდინარე დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    decayMeter: {
        title: "დაკლების დრო: ",
        description:
            "დაკლების დრო: არხის {0} ხმის დაკლების მიმდინარე დრო (სიჩქარე) (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    portamentoTimeMeter: {
        title: "პორტამენტოს დრო: ",
        description:
            "პორტამენტოს დრო: არხის {0} პორტამენტოს მიმდინარე ხანგრძლივობა (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით). პორტამენტოს გამოსართავად დააყენეთ 0."
    },

    portamentoControlMeter: {
        title: "პორტამენტოს მართვა: ",
        description:
            "პორტამენტოს მართვა: საწყისი კლავიშის ნომერი, საიდანაც არხზე {0} ტონის სრიალი იწყება (ამ პარამეტრის დაბლოკვა, სავარაუდოდ, არ დაგჭირდებათ)"
    },

    velocitySenseDepthMeter: {
        title: "შეხების მგრძნობელობა: ",
        description:
            "შეხების მგრძნობელობის სიღრმე: რამდენად მგრძნობიარეა არხი {0} ნოტის დაჭერის სიძლიერის მიმართ (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    velocitySenseOffsetMeter: {
        title: "მგრძნობელობის წანაცვლება: ",
        description:
            "შეხების მგრძნობელობის წანაცვლება: არხის {0} ნოტის დაჭერის სიძლიერის წანაცვლება (დასაბლოკად დააწკაპუნეთ მარჯვენა ღილაკით)"
    },

    groupSelector: {
        description: "აირჩიეთ MIDI კონტროლერების ჯგუფი სამართავად",
        effects: "ეფექტები",
        volumeEnvelope: "ხმის გარსი",
        filter: "ფილტრი",
        portamento: "პორტამენტო (ტონის სრიალი)",
        velocitySense: "შეხების მგრძნობელობა",
        systemParameters: "სისტემური პარამეტრები"
    },

    presetSelector: {
        description:
            "შეცვალეთ არხის {0} მიერ გამოყენებული პრესეტი (ინსტრუმენტი)",
        selectionPrompt: "შეცვალეთ ინსტრუმენტი არხისთვის {0}",
        searchPrompt: "ძიება..."
    },

    presetReset: {
        description:
            "განბლოკეთ არხი {0}, რათა პროგრამების შეცვლა შესაძლებელი გახდეს"
    },

    soloButton: {
        description: "არხის {0} სოლო რეჟიმი"
    },

    muteButton: {
        description: "არხის {0} ხმის დადუმება/ჩართვა"
    },

    drumToggleButton: {
        description: "არხზე {0} დასარტყამების ჩართვა/გამორთვა"
    },

    polyMonoButton: {
        description: `არხზე {0} პოლი/მონო რეჟიმის გადართვა`
    },

    insertionEffectButton: {
        description: `ჩასმის ეფექტის ჩართვა/გამორთვა არხზე {0}`
    }
};
