export const effectsConfig = {
    toggleLock: {
        title: "დაბლოკვის ჩართვა/გამორთვა",
        description:
            "დაბლოკვის ჩართვა/გამორთვა: MIDI მონაცემებს ეფექტის პარამეტრების შეცვლის უფლება არ მისცეთ."
    },

    misc: {
        title: "სინთეზატორის კონფიგურაცია",
        description: "სინთეზატორის დამატებითი პარამეტრების კონფიგურაცია.",

        interpolation: {
            description:
                "ინტერპოლაცია: აირჩიეთ სინთეზატორის ინტერპოლაციის მეთოდი",
            linear: "წრფივი ინტერპოლაცია",
            nearestNeighbor: "უახლოესი მეზობელი",
            cubic: "კუბური ინტერპოლაცია"
        },

        sampleRate: {
            title: "დისკრეტიზაციის სიხშირე",
            description:
                "დისკრეტიზაციის სიხშირე: შეცვალეთ სინთეზატორის დისკრეტიზაციის სიხშირე",
            warning:
                "დისკრეტიზაციის სიხშირის შეცვლა მოითხოვს გვერდის ხელახლა ჩატვირთვას. დარწმუნებული ხართ, რომ გსურთ გაგრძელება?"
        },

        voiceCap: {
            title: "ხმების ლიმიტი",
            description:
                "ხმების ლიმიტი: ერთდროულად დასაკრავად დაშვებული ხმების მაქსიმალური რაოდენობა"
        },

        msgsCutoff: {
            title: "MSGS ნოტის შეწყვეტა",
            description:
                "MSGS ნოტის შეწყვეტა: დაუყოვნებლივ წყვეტს წინა ნოტს იმავე კლავიშზე და Microsoft GS Wavetable Synthesizer-ის მუშაობას ემსგავსება"
        },

        blackMidiMode: {
            title: "Black MIDI რეჟიმი",
            description:
                "Black MIDI რეჟიმი: რთავს მაღალი წარმადობის რეჟიმს, ამარტივებს ვიზუალურ იერს და ნოტებს უფრო სწრაფად წყვეტს"
        },

        drumEditing: {
            title: "დრამების რედაქტირება",
            description:
                "დრამების რედაქტირება: MIDI სისტემური ექსკლუზიური შეტყობინებების მეშვეობით დრამის ინსტრუმენტების რედაქტირების დაშვება"
        }
    },

    reverb: {
        title: "რევერბერაციის კონფიგურაცია",
        description: "დააკონფიგურირეთ, როგორ ჟღერდეს რევერბერაციის ეფექტი.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი განსაზღვრავს ეფექტის გაძლიერებას. გაითვალისწინეთ, რომ ექსპორტირებული MIDI ფაილის შემთხვევაში ეს პარამეტრი არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი განსაზღვრავს ეფექტის რაოდენობას."
        },

        preLowpass: {
            title: "წინასწარი LPF: ",
            description:
                "წინასწარი LPF: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალი სიხშირეების გამტარი ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ მაღალ სიხშირეს შეამცირებს, " +
                "რის შედეგადაც ეფექტის ხმა უფრო რბილი გახდება."
        },

        character: {
            title: "ხასიათი: ",
            description:
                "ხასიათი: ეს პარამეტრი ირჩევს რევერბერაციის ტიპს. 0–5 არის რევერბერაციის ეფექტები, ხოლო 6 და 7 — დაყოვნების ეფექტები."
        },

        time: {
            title: "დრო: ",
            description:
                "დრო: ეს პარამეტრი განსაზღვრავს, რამდენ ხანს გაგრძელდება რევერბერაცია. " +
                "უფრო მაღალი მნიშვნელობები უფრო ხანგრძლივ რევერბერაციას იძლევა."
        },

        delayFeedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი გამოიყენება, როდესაც Reverb-ის ხასიათი დაყენებულია 6-ზე ან 7-ზე. " +
                "ის განსაზღვრავს, როგორ განმეორდეს დაყოვნებები. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ განმეორებას იძლევა."
        },

        preDelayTime: {
            title: "წინასწარი დაყოვნება: ",
            description:
                "წინასწარი დაყოვნება: ეს პარამეტრი განსაზღვრავს დაყოვნების დროს, სანამ რევერბერაციით დამუშავებული ხმა გაისმება. " +
                "უფრო მაღალი მნიშვნელობები უფრო ხანგრძლივ წინასწარ დაყოვნებას იძლევა და უფრო დიდი რევერბერაციის სივრცის იმიტაციას ახდენს."
        }
    },

    chorus: {
        title: "ქორუსის კონფიგურაცია",
        description: "დააკონფიგურირეთ, როგორ ჟღერდეს ქორუსის ეფექტი.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი განსაზღვრავს ეფექტის გაძლიერებას. გაითვალისწინეთ, რომ ექსპორტირებული MIDI ფაილის შემთხვევაში ეს პარამეტრი არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი განსაზღვრავს ეფექტის რაოდენობას."
        },

        preLowpass: {
            title: "წინასწარი LPF: ",
            description:
                "წინასწარი LPF: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალი სიხშირეების გამტარი ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ მაღალ სიხშირეს შეამცირებს, " +
                "რის შედეგადაც ეფექტის ხმა უფრო რბილი გახდება."
        },

        feedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი განსაზღვრავს სიჩქარეს (სიხშირეს), რომლითაც ქორუსის ხმა მოდულირდება. " +
                "უფრო მაღალი მნიშვნელობები უფრო სწრაფ მოდულაციას იძლევა."
        },

        delay: {
            title: "დაყოვნება: ",
            description:
                "დაყოვნება: ეს პარამეტრი განსაზღვრავს ქორუსის ეფექტის დაყოვნების დროს."
        },

        rate: {
            title: "სიჩქარე: ",
            description:
                "სიჩქარე: ეს პარამეტრი განსაზღვრავს სიჩქარეს (სიხშირეს), რომლითაც ქორუსის ხმა მოდულირდება. " +
                "უფრო მაღალი მნიშვნელობები უფრო სწრაფ მოდულაციას იძლევა."
        },

        depth: {
            title: "სიღრმე: ",
            description:
                "სიღრმე: ეს პარამეტრი განსაზღვრავს ქორუსის ხმის მოდულაციის სიღრმეს. " +
                "უფრო მაღალი მნიშვნელობები უფრო ღრმა მოდულაციას იძლევა."
        },

        sendLevelToReverb: {
            title: "რევერბერაციაზე გაგზავნის დონე: ",
            description:
                "რევერბერაციაზე გაგზავნის დონე: ეს პარამეტრი განსაზღვრავს ქორუსის ხმის რა რაოდენობა გაიგზავნება რევერბერაციაზე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        },

        sendLevelToDelay: {
            title: "დაყოვნებაზე გაგზავნის დონე: ",
            description:
                "დაყოვნებაზე გაგზავნის დონე: ეს პარამეტრი განსაზღვრავს ქორუსის ხმის რა რაოდენობა გაიგზავნება დაყოვნებაზე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        }
    },

    delay: {
        title: "დაყოვნების კონფიგურაცია",
        description: "დააკონფიგურირეთ, როგორ ჟღერდეს დაყოვნების ეფექტი.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი განსაზღვრავს ეფექტის გაძლიერებას. გაითვალისწინეთ, რომ ექსპორტირებული MIDI ფაილის შემთხვევაში ეს პარამეტრი არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი განსაზღვრავს ეფექტის რაოდენობას."
        },

        preLowpass: {
            title: "წინასწარი LPF: ",
            description:
                "წინასწარი LPF: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალი სიხშირეების გამტარი ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ მაღალ სიხშირეს შეამცირებს, " +
                "რის შედეგადაც ეფექტის ხმა უფრო რბილი გახდება."
        },

        timeCenter: {
            title: "ცენტრალური დრო: ",
            description:
                "ცენტრალური დრო: დაყოვნების ეფექტს აქვს დაყოვნების სამი დრო: ცენტრალური, " +
                "მარცხენა და მარჯვენა (სტერეოში მოსმენისას). " +
                "ცენტრალური დაყოვნების დრო განსაზღვრავს ცენტრალური დაყოვნების დროს."
        },

        timeRatioLeft: {
            title: "მარცხენა დროის შეფარდება: ",
            description:
                "მარცხენა დროის შეფარდება: ეს პარამეტრი განსაზღვრავს მარცხენა დაყოვნების დროს " +
                "ცენტრალური დაყოვნების დროის პროცენტული წილის სახით (მაქსიმუმ 1.0 წმ-მდე)."
        },

        timeRatioRight: {
            title: "მარჯვენა დროის შეფარდება: ",
            description:
                "მარჯვენა დროის შეფარდება: ეს პარამეტრი განსაზღვრავს მარჯვენა დაყოვნების დროს " +
                "ცენტრალური დაყოვნების დროის პროცენტული წილის სახით (მაქსიმუმ 1.0 წმ-მდე)."
        },

        levelCenter: {
            title: "ცენტრალური დონე: ",
            description:
                "ცენტრალური დონე: ეს პარამეტრი განსაზღვრავს ცენტრალური დაყოვნების ხმას. " +
                "უფრო მაღალი მნიშვნელობები უფრო ხმამაღალ ცენტრალურ დაყოვნებას იძლევა."
        },

        levelLeft: {
            title: "მარცხენა დონე: ",
            description:
                "მარცხენა დონე: ეს პარამეტრი განსაზღვრავს მარცხენა დაყოვნების ხმას. " +
                "უფრო მაღალი მნიშვნელობები უფრო ხმამაღალ მარცხენა დაყოვნებას იძლევა."
        },

        levelRight: {
            title: "მარჯვენა დონე: ",
            description:
                "მარჯვენა დონე: ეს პარამეტრი განსაზღვრავს მარჯვენა დაყოვნების ხმას. " +
                "უფრო მაღალი მნიშვნელობები უფრო ხმამაღალ მარჯვენა დაყოვნებას იძლევა."
        },

        feedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი გავლენას ახდენს დაყოვნების გამეორებების რაოდენობაზე. " +
                "მნიშვნელობა 0 ნიშნავს, რომ დაყოვნება არ განმეორდება. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ გამეორებას იძლევა." +
                " უარყოფითი (-) მნიშვნელობების შემთხვევაში ცენტრალური დაყოვნების უკუკავშირი შებრუნებული ფაზით ხდება." +
                " უარყოფითი მნიშვნელობები ეფექტურია მოკლე დაყოვნების დროს."

        },

        sendLevelToReverb: {
            title: "რევერბერაციაზე გაგზავნის დონე: ",
            description:
                "რევერბერაციაზე გაგზავნის დონე: ეს პარამეტრი განსაზღვრავს დაყოვნების ხმის რა რაოდენობა გაიგზავნება რევერბერაციაზე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        }
    },

    insertion: {
        title: "ინსერტული ეფექტის კონფიგურაცია",
        description:
            "აირჩიეთ ინსერტული ეფექტი და დააკონფიგურირეთ, როგორ უნდა ჟღერდეს იგი.",

        activeChannels: {
            title: "აქტიური არხები",
            description:
                "აირჩიეთ, რომელ არხებზე იქნება ჩართული ინსერტული ეფექტი."
        },

        sendLevelToReverb: {
            title: "რევერბერაციაზე გაგზავნის დონე: ",
            description:
                "რევერბერაციაზე გაგზავნის დონე: დაარეგულირეთ ინსერტული ეფექტის შემდეგ მიღებული ხმის რევერბერაციაზე გაგზავნის დონე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        },

        sendLevelToChorus: {
            title: "ქორუსზე გაგზავნის დონე: ",
            description:
                "ქორუსზე გაგზავნის დონე: დაარეგულირეთ ინსერტული ეფექტის შემდეგ მიღებული ხმის ქორუსზე გაგზავნის დონე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        },

        sendLevelToDelay: {
            title: "დაყოვნებაზე გაგზავნის დონე: ",
            description:
                "დაყოვნებაზე გაგზავნის დონე: დაარეგულირეთ ინსერტული ეფექტის შემდეგ მიღებული ხმის დაყოვნებაზე გაგზავნის დონე. " +
                "უფრო მაღალი მნიშვნელობები უფრო მეტ ხმას აგზავნის."
        }
    }
};