export const effectsConfig = {
    toggleLock: {
        title: "ბლოკირების ჩართვა/გამორთვა",
        description:
            "ბლოკირების ჩართვა/გამორთვა: MIDI მონაცემებისთვის ეფექტის პარამეტრების შეცვლის აკრძალვა."
    },

    misc: {
        title: "სინთეზატორის კონფიგურაცია",
        description: "სინთეზატორის დამატებითი პარამეტრების კონფიგურაცია.",

        interpolation: {
            description:
                "ინტერპოლაცია: აირჩიეთ სინთეზატორის ინტერპოლაციის მეთოდი",
            linear: "ხაზოვანი ინტერპოლაცია",
            nearestNeighbor: "უახლოესი მეზობლის მეთოდი",
            cubic: "კუბური ინტერპოლაცია"
        },

        sampleRate: {
            title: "დისკრეტიზაციის სიხშირე",
            description:
                "დისკრეტიზაციის სიხშირე: სინთეზატორის დისკრეტიზაციის სიხშირის შეცვლა",
            warning:
                "დისკრეტიზაციის სიხშირის შესაცვლელად საჭიროა გვერდის გადატვირთვა. დარწმუნებული ხართ, რომ გსურთ გაგრძელება?"
        },

        voiceCap: {
            title: "ხმების მაქსიმალური რაოდენობა",
            description:
                "ხმების მაქსიმალური რაოდენობა: ერთდროულად დასაკრავად დაშვებული ხმების მაქსიმალური რაოდენობა"
        },

        customVibrato: {
            title: "მორგებული ვიბრატო",
            description:
                "მორგებული ვიბრატო: არასტანდარტული ვიბრატო, რომელსაც ზოგიერთი SC-88Pro MIDI ფაილის ჟღერადობის გაუმჯობესება შეუძლია."
        },

        msgsCutoff: {
            title: "MSGS ნოტის შეწყვეტა",
            description:
                "MSGS ნოტის შეწყვეტა: იმავე კლავიშზე წინა ნოტის დაუყოვნებლივ შეწყვეტა Microsoft GS Wavetable Synthesizer-ის მუშაობის იმიტაციისთვის"
        },

        blackMidiMode: {
            title: "Black MIDI რეჟიმი",
            description:
                "Black MIDI რეჟიმი: მაღალი წარმადობის რეჟიმის ჩართვა, ვიზუალური იერსახის გამარტივება და ნოტების უფრო სწრაფად გაქრობა"
        },

        drumEditing: {
            title: "დასარტყამი ინსტრუმენტების რედაქტირება",
            description:
                "დასარტყამი ინსტრუმენტების რედაქტირება: MIDI System Exclusive შეტყობინებებით დასარტყამი ინსტრუმენტების რედაქტირების დაშვება"
        }
    },

    reverb: {
        title: "GS რევერბერაციის კონფიგურაცია",
        description: "რევერბერაციის ეფექტის ჟღერადობის კონფიგურაცია.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი ეფექტის გაძლიერებას განსაზღვრავს. გაითვალისწინეთ, რომ ექსპორტირებულ MIDI ფაილში ეს მნიშვნელობა არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი ეფექტის ინტენსივობას განსაზღვრავს."
        },

        preLowpass: {
            title: "წინასწარი დაბალსიხშირული ფილტრი: ",
            description:
                "წინასწარი დაბალსიხშირული ფილტრი: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალსიხშირული ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტად სუსტდება მაღალი სიხშირეები, " +
                "რის შედეგადაც ეფექტის ჟღერადობა უფრო რბილი ხდება."
        },

        character: {
            title: "ტიპი: ",
            description:
                "ტიპი: ეს პარამეტრი რევერბერაციის ტიპს განსაზღვრავს. 0–5 მნიშვნელობები რევერბერაციის ეფექტებს შეესაბამება, " +
                "ხოლო 6 და 7 — დაყოვნების ეფექტებს."
        },

        time: {
            title: "ხანგრძლივობა: ",
            description:
                "ხანგრძლივობა: ეს პარამეტრი რევერბერაციის გაგრძელების დროს განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ხანგრძლივია რევერბერაცია."
        },

        delayFeedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი გამოიყენება, როდესაც რევერბერაციის ტიპი 6 ან 7 არის. " +
                "ის განსაზღვრავს დაყოვნებული სიგნალის გამეორების ხასიათს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტჯერ მეორდება სიგნალი."
        },

        preDelayTime: {
            title: "წინასწარი დაყოვნება: ",
            description:
                "წინასწარი დაყოვნება: ეს პარამეტრი განსაზღვრავს დროის შუალედს თავდაპირველ ხმასა და რევერბერაციის გაგონებას შორის. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ხანგრძლივია წინასწარი დაყოვნება და მით უფრო დიდი სივრცის შთაბეჭდილება იქმნება."
        }
    },

    convolver: {
        title: "კონვოლუციური რევერბერაციის კონფიგურაცია",
        description:
            "კონვოლუციაზე დაფუძნებული რევერბერაციის ჟღერადობის კონფიგურაცია.",
        reloadConvolver: "კონვოლუციის რეჟიმში გადატვირთვა",
        reloadNormal: "SpessaSynth-ის სტანდარტული რევერბერაციით გადატვირთვა",
        impulseResponse: {
            title: "იმპულსური მახასიათებლის არჩევა",
            description:
                "აირჩიეთ აუდიოფაილი, რომელიც კონვოლუციური რევერბერაციის იმპულსურ მახასიათებლად იქნება გამოყენებული.",
            decodeError: {
                title: "იმპულსური მახასიათებლის დეკოდირება ვერ მოხერხდა",
                description:
                    "არჩეული ფაილის აუდიოდ დეკოდირება ვერ მოხერხდა. მიმდინარე იმპულსური მახასიათებელი შენარჩუნდა."
            }
        }
    },

    chorus: {
        title: "GS ქორუსის კონფიგურაცია",
        description: "ქორუსის ეფექტის ჟღერადობის კონფიგურაცია.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი ეფექტის გაძლიერებას განსაზღვრავს. გაითვალისწინეთ, რომ ექსპორტირებულ MIDI ფაილში ეს მნიშვნელობა არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი ეფექტის ინტენსივობას განსაზღვრავს."
        },

        preLowpass: {
            title: "წინასწარი დაბალსიხშირული ფილტრი: ",
            description:
                "წინასწარი დაბალსიხშირული ფილტრი: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალსიხშირული ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტად სუსტდება მაღალი სიხშირეები, " +
                "რის შედეგადაც ეფექტის ჟღერადობა უფრო რბილი ხდება."
        },

        feedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი ქორუსის ხმის მოდულაციის სიჩქარეს (სიხშირეს) განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო სწრაფია მოდულაცია."
        },

        delay: {
            title: "დაყოვნება: ",
            description:
                "დაყოვნება: ეს პარამეტრი ქორუსის ეფექტის დაყოვნების დროს განსაზღვრავს."
        },

        rate: {
            title: "სიხშირე: ",
            description:
                "სიხშირე: ეს პარამეტრი ქორუსის ხმის მოდულაციის სიჩქარეს (სიხშირეს) განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო სწრაფია მოდულაცია."
        },

        depth: {
            title: "სიღრმე: ",
            description:
                "სიღრმე: ეს პარამეტრი ქორუსის ხმის მოდულაციის სიღრმეს განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ღრმაა მოდულაცია."
        },

        sendLevelToReverb: {
            title: "რევერბერაციაში გაგზავნის დონე: ",
            description:
                "რევერბერაციაში გაგზავნის დონე: განსაზღვრავს ქორუსის ხმის იმ რაოდენობას, რომელიც რევერბერაციაში გაიგზავნება. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        },

        sendLevelToDelay: {
            title: "დაყოვნებაში გაგზავნის დონე: ",
            description:
                "დაყოვნებაში გაგზავნის დონე: განსაზღვრავს ქორუსის ხმის იმ რაოდენობას, რომელიც დაყოვნების ეფექტში გაიგზავნება. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        }
    },

    delay: {
        title: "GS დაყოვნების კონფიგურაცია",
        description: "დაყოვნების ეფექტის ჟღერადობის კონფიგურაცია.",

        gain: {
            title: "გაძლიერება: ",
            description:
                "გაძლიერება: ეს პარამეტრი ეფექტის გაძლიერებას განსაზღვრავს. გაითვალისწინეთ, რომ ექსპორტირებულ MIDI ფაილში ეს მნიშვნელობა არ შეინახება."
        },

        level: {
            title: "დონე: ",
            description: "დონე: ეს პარამეტრი ეფექტის ინტენსივობას განსაზღვრავს."
        },

        preLowpass: {
            title: "წინასწარი დაბალსიხშირული ფილტრი: ",
            description:
                "წინასწარი დაბალსიხშირული ფილტრი: ეფექტში შემომავალ ხმაზე შესაძლებელია დაბალსიხშირული ფილტრის გამოყენება მაღალი სიხშირეების შესამცირებლად. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტად სუსტდება მაღალი სიხშირეები, " +
                "რის შედეგადაც ეფექტის ჟღერადობა უფრო რბილი ხდება."
        },

        timeCenter: {
            title: "ცენტრალური დაყოვნების დრო: ",
            description:
                "ცენტრალური დაყოვნების დრო: დაყოვნების ეფექტს სამი დრო აქვს — ცენტრალური, " +
                "მარცხენა და მარჯვენა (სტერეოში მოსმენისას). " +
                "ცენტრალური დაყოვნების დრო განსაზღვრავს ცენტრალური დაყოვნების სიგნალის დაყოვნების ხანგრძლივობას."
        },

        timeRatioLeft: {
            title: "მარცხენა დაყოვნების დროის თანაფარდობა: ",
            description:
                "მარცხენა დაყოვნების დროის თანაფარდობა: მარცხენა არხის დაყოვნების დროს განსაზღვრავს " +
                "ცენტრალური დაყოვნების დროის პროცენტული წილის სახით (მაქსიმუმ 1.0 წმ)."
        },

        timeRatioRight: {
            title: "მარჯვენა დაყოვნების დროის თანაფარდობა: ",
            description:
                "მარჯვენა დაყოვნების დროის თანაფარდობა: მარჯვენა არხის დაყოვნების დროს განსაზღვრავს " +
                "ცენტრალური დაყოვნების დროის პროცენტული წილის სახით (მაქსიმუმ 1.0 წმ)."
        },

        levelCenter: {
            title: "ცენტრალური დონის მნიშვნელობა: ",
            description:
                "ცენტრალური დონის მნიშვნელობა: ცენტრალური დაყოვნების ხმის სიმძლავრეს განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ხმამაღალია ცენტრალური დაყოვნება."
        },

        levelLeft: {
            title: "მარცხენა დონის მნიშვნელობა: ",
            description:
                "მარცხენა დონის მნიშვნელობა: მარცხენა დაყოვნების ხმის სიმძლავრეს განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ხმამაღალია მარცხენა დაყოვნება."
        },

        levelRight: {
            title: "მარჯვენა დონის მნიშვნელობა: ",
            description:
                "მარჯვენა დონის მნიშვნელობა: მარჯვენა დაყოვნების ხმის სიმძლავრეს განსაზღვრავს. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით უფრო ხმამაღალია მარჯვენა დაყოვნება."
        },

        feedback: {
            title: "უკუკავშირი: ",
            description:
                "უკუკავშირი: ეს პარამეტრი დაყოვნების გამეორებების რაოდენობაზე მოქმედებს. " +
                "მნიშვნელობა 0 ნიშნავს, რომ დაყოვნება არ განმეორდება. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი გამეორება იქნება." +
                " უარყოფითი (-) მნიშვნელობებისას ცენტრალური დაყოვნების სიგნალი უკუფაზით ბრუნდება." +
                " უარყოფითი მნიშვნელობები ეფექტურია დაყოვნების მოკლე დროისას."
        },

        sendLevelToReverb: {
            title: "რევერბერაციაში გაგზავნის დონე: ",
            description:
                "რევერბერაციაში გაგზავნის დონე: განსაზღვრავს დაყოვნების ხმის იმ რაოდენობას, რომელიც რევერბერაციაში გაიგზავნება. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        }
    },

    insertion: {
        title: "GS ჩასმის ეფექტის კონფიგურაცია",
        description: "აირჩიეთ ჩასმის ეფექტი და დააკონფიგურირეთ მისი ჟღერადობა.",

        activeChannels: {
            title: "აქტიური არხები",
            description: "აირჩიეთ, რომელ არხებზე იქნება ჩასმის ეფექტი ჩართული."
        },

        sendLevelToReverb: {
            title: "რევერბერაციაში გაგზავნის დონე: ",
            description:
                "რევერბერაციაში გაგზავნის დონე: დაარეგულირეთ ჩასმის ეფექტის შემდეგ მიღებული ხმის რევერბერაციაში გაგზავნის დონე. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        },

        sendLevelToChorus: {
            title: "ქორუსში გაგზავნის დონე: ",
            description:
                "ქორუსში გაგზავნის დონე: დაარეგულირეთ ჩასმის ეფექტის შემდეგ მიღებული ხმის ქორუსში გაგზავნის დონე. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        },

        sendLevelToDelay: {
            title: "დაყოვნებაში გაგზავნის დონე: ",
            description:
                "დაყოვნებაში გაგზავნის დონე: დაარეგულირეთ ჩასმის ეფექტის შემდეგ მიღებული ხმის დაყოვნების ეფექტში გაგზავნის დონე. " +
                "რაც უფრო მაღალია მნიშვნელობა, მით მეტი ხმა იგზავნება."
        }
    },

    xg: {
        reverb: {
            title: "XG რევერბერაციის კონფიგურაცია",
            description:
                "აირჩიეთ Yamaha XG რევერბერაციის ტიპი და დააკონფიგურირეთ მისი ჟღერადობა.",
            return: {
                title: "დაბრუნების დონე: ",
                description:
                    "დაბრუნების დონე: ეფექტის გამომავალი სიგნალის დონე. მნიშვნელობა 64 ერთეულოვან გაძლიერებას შეესაბამება, ხოლო 127 — +6 დბ-ს."
            },
            pan: {
                title: "პანორამა: ",
                description:
                    "პანორამა: ეფექტის გამომავალი სიგნალის მდებარეობა სტერეოსივრცეში."
            }
        },

        chorus: {
            title: "XG ქორუსის კონფიგურაცია",
            description:
                "აირჩიეთ Yamaha XG ქორუსის ტიპი და დააკონფიგურირეთ მისი ჟღერადობა.",
            return: {
                title: "დაბრუნების დონე: ",
                description:
                    "დაბრუნების დონე: ეფექტის გამომავალი სიგნალის დონე. მნიშვნელობა 64 ერთეულოვან გაძლიერებას შეესაბამება, ხოლო 127 — +6 დბ-ს."
            },
            pan: {
                title: "პანორამა: ",
                description:
                    "პანორამა: ეფექტის გამომავალი სიგნალის მდებარეობა სტერეოსივრცეში."
            },
            sendToReverb: {
                title: "რევერბერაციაში გაგზავნა: ",
                description:
                    "რევერბერაციაში გაგზავნა: ქორუსის გამომავალი სიგნალის ის რაოდენობა, რომელიც რევერბერაციაში იგზავნება. მნიშვნელობა 64 შეესაბამება 100%-ს."
            }
        },

        variation: {
            title: "XG ვარიაციის კონფიგურაცია",
            description:
                "აირჩიეთ Yamaha XG ვარიაციის ტიპი და დააკონფიგურირეთ მისი ჟღერადობა. " +
                "ის შეიძლება მუშაობდეს როგორც სისტემური ეფექტი ან როგორც ერთი პარტიის ჩასმის ეფექტი.",
            return: {
                title: "დაბრუნების დონე: ",
                description:
                    "დაბრუნების დონე: ეფექტის გამომავალი სიგნალის დონე. მნიშვნელობა 64 ერთეულოვან გაძლიერებას შეესაბამება, ხოლო 127 — +6 დბ-ს."
            },
            pan: {
                title: "პანორამა: ",
                description:
                    "პანორამა: ეფექტის გამომავალი სიგნალის მდებარეობა სტერეოსივრცეში."
            },
            sendToReverb: {
                title: "რევერბერაციაში გაგზავნა: ",
                description:
                    "რევერბერაციაში გაგზავნა: ვარიაციის გამომავალი სიგნალის ის რაოდენობა, რომელიც რევერბერაციაში იგზავნება (მხოლოდ სისტემური კავშირისას). მნიშვნელობა 64 შეესაბამება 100%-ს."
            },
            sendToChorus: {
                title: "ქორუსში გაგზავნა: ",
                description:
                    "ქორუსში გაგზავნა: ვარიაციის გამომავალი სიგნალის ის რაოდენობა, რომელიც ქორუსში იგზავნება (მხოლოდ სისტემური კავშირისას). მნიშვნელობა 64 შეესაბამება 100%-ს."
            },
            connection: {
                description:
                    "კავშირი: ჩასმის რეჟიმი ერთ პარტიას ამუშავებს, ხოლო სისტემური რეჟიმი თითოეული არხის ვარიაციის გაგზავნის პარამეტრს იყენებს.",
                insertion: "ჩასმა",
                system: "სისტემური"
            },
            partNumber: {
                description:
                    "პარტია: ეფექტის მიერ დამუშავებული პარტია (მხოლოდ ჩასმის კავშირისას).",
                off: "გამორთულია"
            }
        },

        insertion: {
            title: "XG ჩასმის ეფექტის კონფიგურაცია",
            description:
                "აირჩიეთ ჩასმის ეფექტი, მისი ტიპი და დააკონფიგურირეთ ჟღერადობა. " +
                "თითოეული ჩასმის ეფექტი ერთ პარტიას ამუშავებს.",
            block: "ჩასმის ეფექტი {0}",
            partNumber: {
                description: "პარტია: ჩასმის ეფექტის მიერ დამუშავებული პარტია.",
                off: "გამორთულია"
            }
        }
    },

    userDrumSet: {
        title: "GS მომხმარებლის დასარტყამი ნაკრების რედაქტორი",
        description:
            "მოარგეთ GS მომხმარებლის დასარტყამი ნაკრები თქვენს სურვილს თითოეული ნოტის ცალ-ცალკე რედაქტირებით. გაითვალისწინეთ, რომ ეს ფუნქცია მხოლოდ GS რეჟიმში მუშაობს.",

        selector: {
            description:
                "აირჩიეთ მომხმარებლის დასარტყამი ნაკრები, რომლის შეცვლაც გსურთ."
        },

        showOnlyChanged: {
            title: "მხოლოდ შეცვლილის ჩვენება",
            description: "მხოლოდ შეცვლილი კლავიშების ჩვენება."
        },

        params: {
            key: {
                title: "კლავიში"
            },

            pitchCoarse: {
                title: "ნოტის სიმაღლე",
                description: `კლავიშზე {0} ნოტის ფარდობითი სიმაღლის რეგულირება. მნიშვნელობა 60 ცვლილებას არ ნიშნავს.`
            },

            level: {
                title: "დონე",
                description:
                    "კლავიშზე {0} ნოტის ხმამაღლობა. მნიშვნელობა 120 ცვლილებას არ ნიშნავს."
            },

            assignGroup: {
                title: "მიკუთვნების ჯგუფი",
                description:
                    // Აღებულია SC-8850-ის სახელმძღვანელოდან
                    "თითოეულ ინსტრუმენტს შეიძლება მიენიჭოს ნომერი, ხოლო ერთნაირი ნომრის მქონე ინსტრუმენტები " +
                    "ერთ მიკუთვნების ჯგუფად განიხილება. ერთი და იმავე ჯგუფის ორი ინსტრუმენტი ერთდროულად " +
                    "არ გაიჟღერებს. თუ ერთი ინსტრუმენტის ჟღერადობისას მიიღება MIDI შეტყობინება " +
                    "იმავე ჯგუფის სხვა ინსტრუმენტის დასაკრავად, პირველი ინსტრუმენტი ჯერ გამოირთვება. " +
                    "ეს ხელს უშლის ისეთი ინსტრუმენტების ერთდროულ ჟღერადობას, რომლებიც ჩვეულებრივ ერთად " +
                    "არ უნდა ჟღერდეს. მაგალითად, ჰაი-ჰეტი ერთდროულად ვერ გამოსცემს ღია და დახურული ჰაი-ჰეტის " +
                    "ხმას, ამიტომ ამ ორ ხმას შეიძლება ერთი და იგივე ჯგუფი (ნომერი) მიენიჭოს, " +
                    "რათა ისინი ერთდროულად არ გაიჟღეროს."
            },

            pan: {
                title: "პანორამა",
                description:
                    "კლავიშზე {0} ნოტის მდებარეობა სტერეოსივრცეში არხთან მიმართებით. მნიშვნელობა 64 ცვლილებას არ ნიშნავს, ხოლო 0 თითოეული ნოტისთვის შემთხვევით პანორამას ჩართავს."
            },

            reverbSend: {
                title: "რევერბერაციაში გაგზავნა",
                description:
                    "კლავიშზე {0} ნოტის რევერბერაციაში გაგზავნის დონე. მნიშვნელობა არხის დონეზე მრავლდება."
            },

            chorusSend: {
                title: "ქორუსში გაგზავნა",
                description:
                    "კლავიშზე {0} ნოტის ქორუსში გაგზავნის დონე. მნიშვნელობა არხის დონეზე მრავლდება."
            },

            variationSend: {
                // Variation ზოგადი სახელია, GS-ში კი გამოიყენება Delay
                title: "დაყოვნებაში გაგზავნა",
                description:
                    "კლავიშზე {0} ნოტის დაყოვნების ეფექტში გაგზავნის დონე. მნიშვნელობა არხის დონეზე მრავლდება."
            },

            rxNoteOn: {
                title: "Note On-ის მიღება",
                description:
                    "კლავიშზე {0} Note On შეტყობინებების მიღების დაშვება ან აკრძალვა."
            },

            rxNoteOff: {
                title: "Note Off-ის მიღება",
                description:
                    "ჩართვის შემთხვევაში, კლავიშზე {0} Note Off შეტყობინების მიღებისას დასარტყამი ნოტის ჟღერადობა დაუყოვნებლივ შეწყდება."
            },

            preset: {
                title: "პრესეტი",
                description: "პრესეტი, რომელსაც კლავიში {0} გამოიყენებს."
            },

            sourceNoteNumber: {
                title: "წყარო ნოტის ნომერი",
                description:
                    "საწყისი დასარტყამი ნაკრების MIDI ნოტის ნომერი. ნოტა {0} არჩეული დასარტყამი ნაკრებიდან ამ ნომრის შესაბამის ხმას დაუკრავს."
            }
        }
    }
};
