export const keyModifiers = {
    button: {
        title: "მკლავების მოდიფიკატორები",
        description: "ცალკეული კლავიშის პარამეტრების შეცვლა"
    },

    mainTitle: "კლავიშის მოდიფიკაციის რედაქტორი",

    detailedDescription:
        "ეს მენიუ საშუალებას გაძლევთ შეცვალოთ MIDI ნოტი მითითებულ არხზე.\n" +
        "ამჟამად შეგიძლიათ შეცვალოთ მისი სიჩქარე და მიუთითოთ გამოყენებული პატჩი (ინსტრუმენტი).\n" +
        " ეს განსაკუთრებით სასარგებლოა დრამებისთვის.",

    prompt: "რისი გაკეთება გსურთ?",

    selectKey: {
        prompt: "დააჭირეთ კლავიატურაზე იმ კლავიშს, რომლის შეცვლაც გსურთ.",
        title: "კლავიშის არჩევა",
        change: "კლავიშის შეცვლა"
    },

    selectedChannel: {
        title: "არჩეული არხი",
        description: "არხი, რომელსაც ეკუთვნის კლავიში, რომლის შეცვლაც გსურთ"
    },

    selectedKey: {
        title: "არჩეული კლავიში: {0}",
        description: "თქვენ აირჩიეთ MIDI ნოტის ნომერი {0}"
    },

    modifyKey: {
        title: "კლავიშის შეცვლა",
        description: "მითითებულ არხზე ერთი კლავიშის შეცვლა",
        velocity: {
            title: "სიჩქარის გადაფარვა",
            description:
                "ამ კლავიშისთვის გამოსაყენებელი სიჩქარე MIDI სიჩქარის იგნორირებით. უცვლელად დასატოვებლად დატოვეთ -1"
        },
        gain: {
            title: "გაძლიერება",
            description: "ამ ხმის ხაზოვანი გაძლიერება. უცვლელად დასატოვებლად დააყენეთ 1."
        },
        preset: {
            title: "პრესეტის გადაფარვა",
            description: "ამ კლავიშისთვის გამოსაყენებელი პრესეტი.",
            unchanged: "უცვლელი"
        },
        apply: {
            title: "გამოყენება",
            description: "არჩეული მოდიფიკატორის გამოყენება"
        }
    },

    removeModification: {
        title: "მოდიფიკაციის წაშლა",
        description: "მითითებულ არხზე ერთი კლავიშიდან მოდიფიკაციის წაშლა",

        remove: {
            title: "წაშლა",
            description: "ამ კლავიშის მოდიფიკატორის წაშლა"
        }
    },

    resetModifications: {
        title: "ცვლილებების გაუქმება",
        description: "ყველა არხიდან ყველა კლავიშის მოდიფიკაციის გასუფთავება და განულება",

        confirmation: {
            title: "დაადასტურეთ მოქმედება",
            description: "დარწმუნებული ხართ, რომ გსურთ ყველა მოდიფიკაციის წაშლა?"
        }
    }
};