export const rendererSettingsLocale = {
    title: "Настройки визуализатора",

    mode: {
        title: "Режим визуализации",
        description: "Изменить режим визуализации каналов",
        waveforms: "Осциллограммы",
        spectrumSplit: "Разделённый спектр",
        spectrum: "Спектр",
        filledWaveforms: "Заполненные осциллограммы"
    },

    noteFallingTime: {
        title: "Время падения нот (мс)",
        description: "Скорость визуального падения нот"
    },

    noteAfterTriggerTime: {
        title: "Время падения нот после срабатывания (мс)",
        description:
            "Как долго ноты падают после срабатывания. Значение 0 означает, что они появляются внизу"
    },

    waveformThickness: {
        title: "Толщина линий осциллограммы (px)",
        description: "Толщина линий осциллограммы"
    },

    waveformSampleSize: {
        title: "Размер выборки",
        description:
            "Детализация визуализации. Обратите внимание: высокие значения могут снизить производительность. Также они увеличивают задержку звука для синхронизации осциллограмм со звуком."
    },

    waveformAmplifier: {
        title: "Усиление",
        description: "Насколько выраженной будет визуализация"
    },

    toggleExponentialGain: {
        title: "Включить экспоненциальное усиление",
        description:
            "Сделать различия в усилении заметнее, используя экспоненциальную, а не линейную зависимость при расчёте высоты"
    },

    toggleDynamicGain: {
        title: "Включить динамическое усиление",
        description:
            "Автоматически регулировать усиление, чтобы самая высокая точка всегда достигала верхней границы дисплея"
    },

    toggleLogarithmicFrequency: {
        title: "Включить логарифмическую шкалу частот",
        description:
            "Распределять частотные диапазоны по логарифмической, а не линейной шкале. Рекомендуется."
    },

    toggleNotesRendering: {
        title: "Показывать ноты",
        description:
            "Отображать падающие ноты при воспроизведении MIDI-файла"
    },

    toggleDrawingActiveNotes: {
        title: "Показывать активные ноты",
        description:
            "Подсвечивать ноты и добавлять свечение при нажатии"
    },

    toggleDrawingVisualPitch: {
        title: "Показывать изменение высоты тона",
        description:
            "Разрешить нотам смещаться влево или вправо при использовании колеса изменения высоты тона"
    },

    toggleDrawingPresetNames: {
        title: "Показывать названия пресетов",
        description:
            "Отображать названия текущих пресетов для каждой осциллограммы"
    },

    toggleRenderingDotDisplay: {
        title: "Показывать точечный дисплей",
        description:
            "Отображать сообщения точечного дисплея GS/XG"
    },

    toggleStabilizeWaveforms: {
        title: "Стабилизировать осциллограммы",
        description: "Включить синхронизацию осциллографа"
    }
};