export const channelControllerLocale = {
    voiceMeter: {
        title: "Голоса: ",
        description:
            "Голоса: текущее количество звучащих голосов на канале {0}"
    },

    pitchBendMeter: {
        title: "Высота тона: ",
        description:
            "Колесо изменения высоты тона: текущее значение изменения высоты тона на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    panMeter: {
        title: "Панорама: ",
        description:
            "Панорама: текущее положение стереопанорамы канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    expressionMeter: {
        title: "Выразительность: ",
        description:
            "Выразительность: текущий уровень выразительности (громкости) канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    volumeMeter: {
        title: "Громкость: ",
        description:
            "Громкость: текущая громкость канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    modulationWheelMeter: {
        title: "Модуляция: ",
        description:
            "Колесо модуляции: текущая глубина модуляции (обычно вибрато) канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    chorusMeter: {
        title: "Хор: ",
        description:
            "Уровень хора: текущий уровень эффекта хора на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    reverbMeter: {
        title: "Реверберация: ",
        description:
            "Уровень реверберации: текущий уровень эффекта реверберации на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    variationMeter: {
        title: "Вариация: ",
        description:
            "Уровень вариации: текущий уровень эффекта вариации на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    filterMeter: {
        title: "Фильтр: ",
        description:
            "Срез фильтра: текущая частота среза фильтра низких частот на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    resonanceMeter: {
        title: "Резонанс: ",
        description:
            "Резонанс фильтра: текущий уровень резонанса (Q) фильтра низких частот на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    transposeMeter: {
        title: "Сдвиг тональности: ",
        description:
            "Сдвиг тональности: текущее транспонирование канала {0}."
    },

    fineTuneMeter: {
        title: "Точная настройка: ",
        description:
            "Точная настройка: текущее значение точной настройки канала {0} в центах."
    },

    gainMeter: {
        title: "Усиление: ",
        description:
            "Усиление: текущее усиление канала {0}. Это значение НЕ сохраняется в MIDI-файле!"
    },

    attackMeter: {
        title: "Время атаки: ",
        description:
            "Время атаки: текущая скорость нарастания звука на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    releaseMeter: {
        title: "Время затухания: ",
        description:
            "Время затухания: текущая скорость затухания звука на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    decayMeter: {
        title: "Время спада: ",
        description:
            "Время спада: текущая скорость спада звука на канале {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    portamentoTimeMeter: {
        title: "Время портаменто: ",
        description:
            "Время портаменто: текущее время скольжения высоты тона на канале {0} (щелчок правой кнопкой мыши — зафиксировать). Установите 0, чтобы отключить портаменто."
    },

    portamentoControlMeter: {
        title: "Управление портаменто: ",
        description:
            "Управление портаменто: номер начальной ноты, с которой начинается скольжение на канале {0} (вероятно, этот параметр не стоит фиксировать)"
    },

    velocitySenseDepthMeter: {
        title: "Чувствительность к силе нажатия: ",
        description:
            "Глубина чувствительности к силе нажатия: насколько сильно сила нажатия влияет на звук канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    velocitySenseOffsetMeter: {
        title: "Смещение силы нажатия: ",
        description:
            "Смещение чувствительности к силе нажатия: смещение значения силы нажатия для канала {0} (щелчок правой кнопкой мыши — зафиксировать)"
    },

    groupSelector: {
        description: "Выберите группу MIDI-контроллеров для настройки",
        effects: "Эффекты",
        volumeEnvelope: "Огибающая громкости",
        filter: "Фильтр",
        portamento: "Портаменто (скольжение)",
        velocitySense: "Чувствительность к силе нажатия",
        systemParameters: "Системные параметры"
    },

    presetSelector: {
        description: "Изменить тембр (инструмент), используемый каналом {0}",
        selectionPrompt: "Изменить инструмент для канала {0}",
        searchPrompt: "Поиск..."
    },

    presetReset: {
        description: "Разблокировать канал {0}, чтобы разрешить смену программ"
    },

    soloButton: {
        description: "Соло на канале {0}"
    },

    muteButton: {
        description: "Включить/выключить звук канала {0}"
    },

    drumToggleButton: {
        description: "Включить/выключить ударные на канале {0}"
    },

    polyMonoButton: {
        description: `Переключить режим поли-/монофонии на канале {0}`
    },

    insertionEffectButton: {
        description: `Включить/выключить эффект вставки на канале {0}`
    }
};